#include "hvqm/hvqm2dec.h"
#include "hvqm/HVQM2File.h"
#include "hvqm/HVQmd.h"
#include "include_asm.h"
#include "custom_macros.h"

#define UNK_SIZE 1

typedef void* UNK_PTR;


#define B_009AC0_LEN 0x300


typedef struct struct_00000040_arg0 {
    /* 0x0 */ u32 unk_0;
    /* 0x4 */ s32 unk_4;
    /* 0x8 */ s32 *unk_8;
} struct_00000040_arg0; // size = 0xC

// guessed size
typedef struct struct_00000040_arg1 {
    /* 0x000 */ u16 unk_000;
    /* 0x002 */ u16 unk_002[UNK_SIZE];
    /* 0x004 */ char unk_004[0x3FE];
    /* 0x402 */ u16 unk_402[UNK_SIZE];
    /* 0x404 */ char unk_404[0x3FE];
} struct_00000040_arg1; // size = 0x802

// guessed size
typedef struct struct_009240 {
    /* 0x00 */ u8 *unk_00;
    /* 0x04 */ u8 *unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ u8 *unk_0C;
    /* 0x10 */ u8 *unk_10;
    /* 0x14 */ u8 *unk_14;
    /* 0x18 */ u8 unk_18;
    /* 0x18 */ u8 unk_19;
    /* 0x18 */ u8 unk_1A;
    /* 0x18 */ u8 unk_1B;
    /* 0x1C */ u8 unk_1C;
} struct_009240; // size = 0x1D

// TODO: same struct as struct_009240?
typedef struct struct_009260 {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
} struct_009260; // size >= 0x18


// extern u8 B_005EB0[];
// STATIC u8 B_005EB0[];
/* .space 0xA64 */

// extern u8 B_006914[];
// STATIC u8 B_006914[];
/* .space 0x04 */

// extern u8 B_006918[];
// STATIC u8 B_006918[];
/* .space 0x04 */

// extern u8 B_00691C[];
// STATIC u8 B_00691C[];
/* .space 0x04 */

// extern u8 B_006920[];
// STATIC u8 B_006920[];
/* .space 0x04 */

// extern u8 B_006924[];
// STATIC u8 B_006924[];
/* .space 0x04 */

// extern u8 B_006928[];
// STATIC u8 B_006928[];
/* .space 0x08 */

extern struct_00000040_arg0 B_006930;
// STATIC struct_00000040_arg0 B_006930;
/* .space 0x0C */

extern struct_00000040_arg0 B_00693C;
// STATIC struct_00000040_arg0 B_00693C;
/* .space 0x0C */

extern struct_00000040_arg0 B_006948;
// STATIC struct_00000040_arg0 B_006948;
/* .space 0x0C */

extern struct_00000040_arg0 B_006954;
// STATIC struct_00000040_arg0 B_006954;
/* .space 0x0C */

extern struct_00000040_arg0 B_006960[3];
