#include "hvqm/hvqm2dec.h"
#include "hvqm/HVQM2File.h"
#include "hvqm/HVQmd.h"
#include "include_asm.h"
#include "custom_macros.h"


#define UNK_SIZE 1

typedef void* UNK_PTR;

typedef s32 UNK_TYPE;


typedef struct struct_00000040_arg0 {
    /* 0x0 */ u32 unk_0;
    /* 0x4 */ s32 unk_4;
    /* 0x8 */ s32 *unk_8;
} struct_00000040_arg0; // size = 0xC

// guessed size
typedef struct struct_00000040_arg1 {
    /* 0x000 */ u16 unk_000;
    /* 0x002 */ u16 unk_002[UNK_SIZE];
    /* 0x004 */ char unk_004[0x3FE];
    /* 0x402 */ u16 unk_402[UNK_SIZE];
    /* 0x404 */ char unk_404[0x3FE];
} struct_00000040_arg1; // size = 0x802

// guessed size
typedef struct struct_009240 {
    /* 0x00 */ u8 *unk_00;
    /* 0x04 */ u8 *unk_04;
    /* 0x08 */ u8 *unk_08;
    /* 0x0C */ u8 *unk_0C;
    /* 0x10 */ u8 *unk_10;
    /* 0x14 */ u8 *unk_14;
    /* 0x18 */ u8 unk_18;
    /* 0x18 */ u8 unk_19;
    /* 0x18 */ u8 unk_1A;
    /* 0x18 */ u8 unk_1B;
    /* 0x1C */ u8 unk_1C;
} struct_009240; // size = 0x1D

extern HVQM2Info *B_003D60;
// STATIC HVQM2Info *B_003D60;
/* .space 0x04 */

extern struct_00000040_arg0 B_003D64;
// STATIC struct_00000040_arg0 B_003D64;
/* .space 0x0C */

extern struct_00000040_arg0 B_003D70;
// STATIC struct_00000040_arg0 B_003D70;
/* .space 0x0C */

extern struct_00000040_arg0 B_003D80;
// STATIC struct_00000040_arg0 B_003D80;
/* .space 0x0C */

extern struct_00000040_arg0 B_003D8C;
// STATIC struct_00000040_arg0 B_003D8C;
/* .space 0x0C */

extern struct_00000040_arg0 B_003D98;
// STATIC struct_00000040_arg0 B_003D98;
/* .space 0x0C */

extern struct_00000040_arg0 B_003DA4;
// STATIC struct_00000040_arg0 B_003DA4;
/* .space 0x0C */

extern struct_00000040_arg0 B_003DB0[3];
// STATIC struct_00000040_arg0 B_003DB0[3];
/* .space 0x24 */

extern struct_00000040_arg0 B_003DD8;
// STATIC struct_00000040_arg0 B_003DD8;
/* .space 0x0C */

extern struct_00000040_arg0 B_003DE4;
